export const devLog = [
  {
    date: '2024.05.25',
    content: '修复开箱BUG，修改背包物品默认排序。'
  },
  {
    date: '2024.05.22',
    content: '增加关卡《斯坦索姆》，增加50级装备。'
  },
  {
    date: '2024.05.10',
    content: '增加关卡《祖尔法拉克》，增加40级装备。'
  },
  {
    date: '2024.05.09',
    content: '增加关卡《血色修道院》，增加30级装备。优化装备的等级显示。'
  },
  {
    date: '2024.05.08',
    content: '修改西部荒野产品宝箱及宝箱奖励。增加20级装备。'
  },
  {
    date: '2024.05.07',
    content:
      '提高3倍开箱速度,物品查看时显示物品图标，查看装备时显示当前栏位已装备,降低西部荒野怪物防御，新增装备卸下功能。'
  },
  {
    date: '2024.05.02',
    content: '完善装备功能，装备可穿戴。宝箱新增奖励新手套装一套，优化在线玩家列表查询功能。'
  },
  {
    date: '2024.05.01',
    content: '新增职业大厅，可转职。'
  },
  {
    date: '2024.04.30',
    content: '拍卖行功能已完成，增加世界地图挂机功能,增加部分功能音效，优化开箱概率算法。'
  },
  {
    date: '2024.04.29',
    content: '新增物品售卖功能，新增拍卖行功能（开发中.）'
  },
  {
    date: '2024.04.28',
    content:
      '增加道具，生命之种(可强化基础属性)，改名卡。新增功能：一键开箱，金币排行榜，修改坐骑排序。'
  },
  {
    date: '2024.04.27',
    content: '宝箱增加坐骑200只，增加马厩功能，人物装备模块（暂时还不能穿装备）。'
  },
  {
    date: '2024.04.26',
    content: '宝箱增加经验和装备奖励，增加人物等级模块，增加等级排行榜，其他问题修复及优化。'
  },
  {
    date: '2024.04.24',
    content: '增加在线人数查询，UI及布局修改，增加音乐盒资源*3。增加自定义背景功能及其他优化。'
  },
  { date: '2024.04.21', content: '增加开宝箱功能' },
  { date: '2024.04.15', content: '增加音乐盒功能' },
  { date: '2024.04.10', content: '完成职业设计、玩家属性、战斗功能、第一关关卡、背包的基础功能' },
  { date: '2024.04.02', content: '搭建测试环境及github托管代码' },
  { date: '2024.03.25', content: '完成世界频道功能开发' },
  { date: '2024.03.18', content: '完成注册、登录、修改密码功能开发' },
  { date: '2024.03.11', content: '立项（开始基础框架搭建）' }
]
